
---

### Phase 1 – Network Setup and Subnetting

The first logical step I took was to prepare for future growth by creating multiple subnets. Even though only two subnets were required for the initial setup, I decided to plan ahead and subnet the **10.0.0.0/8** network to accommodate potential expansion in future phases of the organization.

After subnetting the **10.0.0.0/8** network, I ended up with 50 subnets. However, for now, I only needed two subnets, so I calculated and set up the following:

#### Subnetting Details:

- **1st Subnet**: 10.0.0.0/15
- **2nd Subnet**: 10.1.0.0/15

##### Subnet 1 (Link between Router1 and Switch1):
- Network: 10.0.0.0/15
- First IP Address: 10.0.0.1
- Last IP Address: 10.1.255.254
- Broadcast Address: 10.1.255.255

##### Subnet 2 (Site1):
- Network: 10.2.0.0/15
- First IP Address: 10.2.0.1
- Last IP Address: 10.3.255.254
- Broadcast Address: 10.3.255.255

#### Phase 1 Devices Layout:

- **Site1 (Subnet 2)**:
    - 1 x Switch (Switch1)
    - 1 x Server (Server1)
    - 5 x PCs (PC1–5)
    - 1 x Printer (Printer1)

- **Link1 (Subnet 1)**:
    - Router1 is connected to Switch1.

---

### Router Configuration (Link1 Setup):

I began by configuring **Router1** for **Subnet 1**. The configuration process was as follows:

```bash
Router>en
Router#conf t
Enter configuration commands, one per line. End with CNTL/Z.
Router(config)#interface gigabitEthernet 0/0/0
Router(config-if)#ip address 10.0.0.1 255.254.0.0
Router(config-if)#no shutdown
Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/0, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up
```

The **Router1** interface was now up and ready to communicate with the network.

---

### Switch Configuration (Site1 Setup):

Next, I moved to **Switch1**, assigning it the last IP in the subnet. The VLAN 1 interface was configured as follows:

```bash
Switch>en
Switch#conf t
Enter configuration commands, one per line. End with CNTL/Z.
Switch(config)#int vlan 1
Switch(config-if)#ip address 10.3.255.254 255.254.0.0
Switch(config-if)#no shutdown
Switch(config-if)#
%LINK-5-CHANGED: Interface Vlan1, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up
Switch(config-if)#exit
Switch(config)#ip default-gateway 10.0.0.1
```

With the switch configured, I moved on to the server.

---

### Server Configuration (DHCP Setup):

For **Server1**, I set up a static IP address in the **10.3.255.252** range, as it's the second-to-last address in the subnet. I also enabled the DHCP service with the following settings:

- **IP Address**: 10.3.255.253
- **Subnet Mask**: 255.254.0.0
- **Default Gateway**: 10.0.0.1
- **DNS Server**: 8.8.8.8
- **Start IP Address**: 10.2.0.1
- **Subnet Mask**: 255.254.0.0
- **Max Number of Users**: 50

This configuration allows the server to provide DHCP to the devices on the network.

---

### Device Configuration (DHCP for PCs and Printer):

I manually enabled **DHCP** on all the PCs and the printer. The DHCP server successfully assigned correct IPs to each device, based on the server's settings.

At this point, everything seemed to be working well — however, I noticed a critical issue: **None of the devices were able to ping the router**.

---

### The Mistake: Devices in Different Subnets

After some troubleshooting, I realized the mistake I had made: **The router and Site1 were placed in different subnets**. This meant they couldn’t communicate with each other, which was the reason for the pinging issue.

---

### Reconfiguration:

I decided to simplify things and use a single subnet for both the router and Site1, ensuring all devices were in the same network. Here's how I reconfigured everything:

- **Subnet Used**: 10.0.0.0/15 (for both the router and Site1)

#### New Subnet Details:
- **Subnet**: 10.0.0.0/15
- **First IP Address**: 10.0.0.1
- **Last IP Address**: 10.1.255.254
- **Broadcast Address**: 10.1.255.255

---

### Router Reconfiguration:

To align with the new subnet, I reconfigured **Router1** with the last available IP in the subnet:

```bash
Router>en
Router#conf t
Enter configuration commands, one per line. End with CNTL/Z.
Router(config)#interface gigabitEthernet 0/0/0
Router(config-if)#ip address 10.1.255.254 255.254.0.0
Router(config-if)#no shutdown
Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/0, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up
```

---

### Switch Reconfiguration:

The switch was assigned the second-to-last IP in the subnet:

```bash
Switch>en
Switch#conf t
Enter configuration commands, one per line. End with CNTL/Z.
Switch(config)#int vlan 1
Switch(config-if)#ip address 10.1.255.253 255.254.0.0
Switch(config-if)#no shutdown
Switch(config-if)#
%LINK-5-CHANGED: Interface Vlan1, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up
Switch(config-if)#exit
Switch(config)#ip default-gateway 10.1.255.254
```

---

### Server Reconfiguration:

The server was configured with the third-to-last IP address, and its DHCP settings were updated as follows:

```bash
IP Address: 10.1.255.252
Subnet Mask: 255.254.0.0
Default Gateway: 10.1.255.254
DNS Server: 8.8.8.8
Start IP Address: 10.0.0.1
Subnet Mask: 255.254.0.0
Maximum Number of Users: 50
```

---

### Result:

After the reconfiguration, I tested the network, and now **all devices were able to ping each other** successfully! The entire network was now functioning as expected, with the router, switch, server, PCs, and printer all communicating seamlessly.

---

### Conclusion:

This experience taught me the importance of subnetting and understanding how IP addressing and routing work together. I also learned that even small mistakes in subnetting can cause significant communication issues, but careful troubleshooting and reconfiguration can resolve the problem.

---