
Initially, the network is set up including:
1. 4 x PC's
2. 2 x Switches
3. 1 x Hub

Looks as follows:
![[VLAN_SETUP1_Basic_look.png]]

All these devices are now given basic configurations.

### **1. Changing Switches Host Names**

Switch host names are changed to S1 and S2.
For switch 1:
```
Switch>en
Switch#conf t
Enter configuration commands, one per line. End with CNTL/Z.
Switch(config)#hostname S1
S1(config)#exit
```

For switch 2:
```
Switch>en
Switch#conf t
Enter configuration commands, one per line. End with CNTL/Z.
Switch(config)#hostname S2
S2(config)#
```


### **2. Manually Configuring PC's IP Addresses**

All PC's are staticaly assigned IP's and Subnet Masks.

**PC1-4 Subnet Mask**: `255.255.255.0`

**PC1 IP Address**: `10.1.1.1`
**PC2 IP Address**: `10.1.1.2`
**PC3 IP Address**: `10.1.1.3`
**PC4 IP Address**: `10.1.1.4`


### **3. Setting S1 to VTP Transparent**

Until now there's only the default VLAN 1 set up at both switches.
We need to first make VTP on S1 to be transparent so that it does not propogate any VLAN advertisements.
Done as follows:

```
S1>en
S1#conf t
Enter configuration commands, one per line. End with CNTL/Z.
S1(config)#vtp mode transparent
Setting device to VTP TRANSPARENT mode.
S1(config)#exit
S1#
%SYS-5-CONFIG_I: Configured from console by console
S1#sh vlan

VLAN Name Status Ports

---- -------------------------------- --------- -------------------------------

1 default active Fa0/1, Fa0/2, Fa0/3, Fa0/4
Fa0/5, Fa0/6, Fa0/7, Fa0/8
Fa0/9, Fa0/10, Fa0/11, Fa0/12
Fa0/13, Fa0/14, Fa0/15, Fa0/16
Fa0/17, Fa0/18, Fa0/19, Fa0/20
Fa0/21, Fa0/22, Fa0/23, Fa0/24
Gig0/1, Gig0/2
1002 fddi-default active
1003 token-ring-default active
1004 fddinet-default active
1005 trnet-default active

VLAN Type SAID MTU Parent RingNo BridgeNo Stp BrdgMode Trans1 Trans2

---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------

1 enet 100001 1500 - - - - - 0 0
1002 fddi 101002 1500 - - - - - 0 0
1003 tr 101003 1500 - - - - - 0 0
1004 fdnet 101004 1500 - - - ieee - 0 0
1005 trnet 101005 1500 - - - ibm - 0 0

VLAN Type SAID MTU Parent RingNo BridgeNo Stp BrdgMode Trans1 Trans2

---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
Remote SPAN VLANs

------------------------------------------------------------------------------

Primary Secondary Type Ports

------- --------- ----------------- ------------------------------------------

```


### 4. Setting up VLAN 2

Now, we configure VLAN2 on S1.
Done as follows:

```
S1#
S1#conf t
Enter configuration commands, one per line. End with CNTL/Z.
S1(config)#vlan 2
S1(config-vlan)#end
S1#
%SYS-5-CONFIG_I: Configured from console by console
S1#sh vlan

VLAN Name Status Ports

---- -------------------------------- --------- -------------------------------

1 default active Fa0/1, Fa0/2, Fa0/3, Fa0/4
Fa0/5, Fa0/6, Fa0/7, Fa0/8
Fa0/9, Fa0/10, Fa0/11, Fa0/12
Fa0/13, Fa0/14, Fa0/15, Fa0/16
Fa0/17, Fa0/18, Fa0/19, Fa0/20
Fa0/21, Fa0/22, Fa0/23, Fa0/24
Gig0/1, Gig0/2
2 VLAN0002 active
1002 fddi-default active
1003 token-ring-default active
1004 fddinet-default active
1005 trnet-default active

VLAN Type SAID MTU Parent RingNo BridgeNo Stp BrdgMode Trans1 Trans2

---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------

1 enet 100001 1500 - - - - - 0 0
2 enet 100002 1500 - - - - - 0 0
1002 fddi 101002 1500 - - - - - 0 0
1003 tr 101003 1500 - - - - - 0 0
1004 fdnet 101004 1500 - - - ieee - 0 0
1005 trnet 101005 1500 - - - ibm - 0 0

VLAN Type SAID MTU Parent RingNo BridgeNo Stp BrdgMode Trans1 Trans2

---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------

Remote SPAN VLANs

------------------------------------------------------------------------------

Primary Secondary Type Ports

------- --------- ----------------- ------------------------------------------
```


#### **Concepts Involved**:

There's always a VLAN used by default which is the defaut VLAN 1.
Also, if you happen to use wireshark on the access interfaces which are:

- S1: Fa0/1, Fa0/2
- S2: Fa0/2, Fa0/3

You will see that on each interface there will be no trace of any VLAN information passing, clearly means that VLAN's are only at layer 2 and layer 3 and PC's have no knowledge of VLAN's.
All the VLAN segmentation is handled by the switches and routers.

Make sure to first make S1 VTP Transparent, otherwise it will start to propogate VLAN advertisements possibly corrupting VLAN database.