
In this section, we are going to allocate PC2 to VLAN2, PC1 will remain in VLAN1.
Also, we create Layer 3 VLAN configurations so that we can assign IP Address to switch and enable VLAN routing.

### **1. Shut Down all Interfaces except Fa0/1 and Fa0/2**

Here we shut down all other interfaces currently in the state of up.
We can do this for multiple ethernets using the `interface range` command.

This is done as:
```
S1>en
S1#conf t
Enter configuration commands, one per line. End with CNTL/Z.
S1(config)#interface range fastEthernet 0/3 - 4
S1(config-if-range)#shut
```


### **2. Shifting S1 Fa0/2 to VLAN 2**

Lets move Fa0/2 to VLAN 2.

Done as:
```
S1(config)#interface fastEthernet 0/2
S1(config-if)#switchport access vlan 2
```


### **3.  Assigning VLAN and IP to S1**

Assigning VLAN 1 and 2 to the switch.
This will help enable intervlan routing eventually.

This is done as:
```
S1#conf t
Enter configuration commands, one per line. End with CNTL/Z.
S1(config)#int vlan 1
S1(config-if)#ip address 10.1.1.254 255.255.255.0
S1(config-if)#no shut

S1(config-if)#
%LINK-5-CHANGED: Interface Vlan1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up

S1(config-if)#exit
S1(config)#int vlan 2
S1(config-if)#
%LINK-5-CHANGED: Interface Vlan2, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan2, changed state to up

S1(config-if)#ip address 10.1.2.254 255.255.255.0
S1(config-if)#no shut
S1(config-if)#exit
```


### 4. Placing PC2 in a different Subnet

PC2 is placed into a different subnet.
```
IP address: 10.1.2.2
Subnet Mask: 255.255.255.0
```


Next we will work towards trunking S2 with 802.1Q protocol so that S1 is able to communicate VLAN information to S2.


### 5. Enabling IP Routing

In order for PC's to be able to ping each other eventhough on different Subnets and VLAN's, we need to let Switch be in ip routing, as well as, add default gateways to both PC's.

Done as:
```
S1(config)# ip routing
```

Then we go to the PC's and manually configure them.
Done as:

PC1:
Default Gateway: `10.1.1.254`
PC2:
Default Gateway: `10.1.2.254`

### Concepts Involved

Interfaces in different VLAN's in normal configuration can not ping each other.
This clearly elaborates on the security that VLAN's provide.