
### **1. Making S1 Fa0/1-2 to be static**

We make these interfaces as static, which means that they are made to be in mode access and no negotiate since we need DTP or Dynamic Trunking Protocol will be off.

These interfaces won't do any trunking, their main role will be to act as access ports wherein VLAN's can communicate.

Done as:
```
S1>en
S1#conf t
Enter configuration commands, one per line. End with CNTL/Z.
S1(config)#interface fastEthernet 0/1
S1(config-if)#switchport mode access
S1(config-if)#switchport nonegotiate

S1(config-if)#exit

S1(config)#interface fastEthernet 0/2
S1(config-if)#switchport mode access
S1(config-if)#switchport nonegotiate
```


### 2. Setting Up S1 Fa0/3-4 as Trunks

There needs to be a way for S1 to transmit VLAN information, which can't be done on ordinary access ports.
This is why we need trunk ports that help Switches or Layer 3 devices to communicate VLAN information.

Done as:
```
S1>en
S1#conf t
Enter configuration commands, one per line. End with CNTL/Z.
S1(config)#interface fastEthernet 0/3
S1(config-if)#switchport trunk encapsulation dot1q
S1(config-if)#switchport mode trunk
S1(config-if)#switchport nonegotiate
S1(config-if)#no shut

S1(config-if)#exit

S1(config)#interface fastEthernet 0/4
S1(config-if)#switchport trunk encapsulation dot1q
S1(config-if)#switchport mode trunk
S1(config-if)#switchport nonegotiate
S1(config-if)#no shut

S1(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/4, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/4, changed state to up

```


### **3. Putting PC4 into same subnet as PC2**

Since we need PC2 and PC4 in VLAN 2, we will also assign them the same subnet.
This putting them in the same subnet will help to allocate the same VLAN i.e. VLAN 2 to each PC2 and PC4.

Done as:
```
IP Address: 10.1.2.4
Subnet Mask: 255.255.255.0
```


### **4. Adding S2 FastEthernet 0/3 to VLAN 2**  

PC 4's interface is now going to be placed into VLAN2.
This is done so that PC2 and PC4 can be placed in the same VLAN and are able to communicate.

Done as follows:
```
S2#
S2#conf t
Enter configuration commands, one per line. End with CNTL/Z.
S2(config)#vtp mode transparent
Setting device to VTP TRANSPARENT mode.
S2(config)#vlan 2

S2(config-vlan)#exit

S2(config)#interface fastEthernet 0/3
S2(config-if)#switchport mode access
S2(config-if)#switchport access vlan 2
S2(config-if)#switchport nonegotiate
```

Even after doing this PC2 and PC4 are not able to ping each other.


### **5. Adding VLAN to S2 Ethernet Interfaces**

On S2, we add VLAN interfaces to S2, so that PC's have a default gateway to reach from when trying communicate to other devices.

Done as:
```
S2(config)#interface fastEthernet 0/1
S2(config-if)#int vlan 1
S2(config-if)#ip address 10.1.1.253 255.255.255.0
S2(config-if)#no shutdown
S2(config-if)#
%LINK-5-CHANGED: Interface Vlan1, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up

S2(config-if)#exit

S2(config)#interface fastEthernet 0/2
S2(config-if)#int vlan 2
S2(config-if)#
%LINK-5-CHANGED: Interface Vlan2, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan2, changed state to up
S2(config-if)#ip address 10.1.2.253 255.255.255.0
S2(config-if)#no shutdown
```

### Concepts Involved

Trunk ports help VLAN's communicate in all intervlan communication.
Access ports need to be made into Trunks with Dot1Q or 802.1Q trunking protocol.