
So far, the issue that arrives for why PC2 is not able to ping PC1 although they are in the same VLAN is as follows:

As a ping is sent from PC2 an ARP is sent with destination a broadcast and source as MAC of PC1, we shut down down S1 Fa0/3 to anayse the traffic but even the hub was not able to transmit the ARP to PC4.
Digging deeper it was observed that S2 Fa0/4 was not set as a trunk and hence it behaved as default VLAN 1. So when the ping came to S2 it simply passed that ARP to PC3 which is also by default in VLAN 1.

### **1. Making S2 Fa 0/3 and 0/4 to be Trunks**

Unless these ports are Trunks, they won't be able to transmit VLAN information from one Switch to another. This is why they need to be trunked.

Done as follows:
```
S2>en
S2#conf t
S2(config)#interface fastEthernet 0/1
S2(config-if)#switchport trunk encapsulation dot1q
S2(config-if)#switchport mode trunk
S2(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to down
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up
S2(config-if)#switchport nonegotiate
S2(config)#interface fastEthernet 0/1

S2(config-if)#exit

S2(config)#interface fastEthernet 0/4
S2(config-if)#switchport trunk encapsulation dot1q
S2(config-if)#switchport mode trunk
S2(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/4, changed state to down
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/4, changed state to up
S2(config-if)#switchport nonegotiate
S2(config-if)#no shut

S2(config-if)#exit
```


### 2. Let's ping PC4 from PC2 now

To test whether PC2 is now able to ping PC4 and vice versa.

Done as:
```
C:\>ping 10.1.2.4

Pinging 10.1.2.4 with 32 bytes of data:

Reply from 10.1.2.4: bytes=32 time<1ms TTL=128
Reply from 10.1.2.4: bytes=32 time<1ms TTL=128
Reply from 10.1.2.4: bytes=32 time<1ms TTL=128
Reply from 10.1.2.4: bytes=32 time<1ms TTL=128

Ping statistics for 10.1.2.4:
Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
Minimum = 0ms, Maximum = 0ms, Average = 0ms
```

Voila! The ping succeeded!


### 3. Setting PC1 and PC3 in VLAN 10

Setting PC's 1 and 3 in different VLAN i.e. VLAN 10. So that their communication is private.

For PC1 done as:
```
S1>en
S1#conf t
Enter configuration commands, one per line. End with CNTL/Z.
S1(config)#vlan 10
S1(config-vlan)#
%LINK-5-CHANGED: Interface Vlan10, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan10, changed state to up

S1(config-vlan)#exit

S1(config)#interface fastEthernet 0/1
S1(config-if)#switchport access vlan 10
```

For PC3 done as:
```
S2>en
S2#conf t
Enter configuration commands, one per line. End with CNTL/Z.
S2(config)#vlan 10

S2(config-vlan)#exit

S2(config)#interface fastEthernet 0/2
S2(config-if)#switchport access vlan 10
```

