
### **1. Reconfigure IP's in PC1 and PC3**

Since PC1 and PC3 now belong to VLAN 10, it is common practice to allocate same IP Address to them.

For PC1 done as:
```
IP Address: 10.1.10.1
Subnet Mask: 255.255.255.0
```

For PC2 done as:
```
IP Address: 10.1.10.3
Subnet Mask: 255.255.255.0
```


### 2. **Configure Switches with VLAN 10 IP's**

It is also good practice to now have S1 and S2 have VLAN 10 routing for IP Addresses.

For S1 done as:
```
S1>en
S1#conf t
Enter configuration commands, one per line. End with CNTL/Z.
S1(config)#interface fastEthernet 0/1
S1(config-if)#int vlan 10
S1(config-if)#ip address 10.1.10.254 255.255.255.0
S1(config-if)#no shutdown
```

For S2 done as:
```
S2>en
S2#conf t
Enter configuration commands, one per line. End with CNTL/Z.
S2(config)#interface fastEthernet 0/1
S2(config-if)#int vlan 10
S2(config-if)#ip address 10.1.10.253 255.255.255.0
S2(config-if)#no shutdown
```


Now, all PC's can ping all PC's.
However, if you want to cut-off inter VLAN routing, you can simply go onto Switches and set it to not route IP.

Done as:
```
S2(config)#no ip routing
```

Voila! You are now set!